Public Attributes | List of all members
API_AnalyticalReleaseDescription Struct Reference
Analytical Model
Contains the Structural Analytical Model Analytical Member Release values. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
API_AnalyticalRigidityType  | ux
Translation type in X direction.
double  | stiffnessX
Translation value in X direction in case of Custom type.
API_AnalyticalRigidityType  | uy
Translation type in Y direction.
double  | stiffnessY
Translation value in Y direction in case of Custom type.
API_AnalyticalRigidityType  | uz
Translation type in Z direction.
double  | stiffnessZ
Translation value in Z direction in case of Custom type.
API_AnalyticalRigidityType  | fix
Rotation type in X direction.
double  | stiffnessFix
Rotation value in X direction in case of Custom type.
API_AnalyticalRigidityType  | fiy
Rotation type in Y direction.
double  | stiffnessFiy
Rotation value in Y direction in case of Custom type.
API_AnalyticalRigidityType  | fiz
Rotation type in Z direction.
double  | stiffnessFiz
Rotation value in Z direction in case of Custom type.
API_AnalyticalMemberPartRef  | amPartRef
The Structural Analytical Member part referenced.
Detailed Description
Contains the Structural Analytical Model Analytical Member Release values.
Since
Archicad 24
Member Data Documentation
◆ amPartRef
 API_AnalyticalReleaseDescription::amPartRef
The Structural Analytical Member part referenced.
◆ fix
 API_AnalyticalReleaseDescription::fix
Rotation type in X direction.
◆ fiy
 API_AnalyticalReleaseDescription::fiy
Rotation type in Y direction.
◆ fiz
 API_AnalyticalReleaseDescription::fiz
Rotation type in Z direction.
◆ stiffnessFix
 API_AnalyticalReleaseDescription::stiffnessFix
Rotation value in X direction in case of Custom type.
◆ stiffnessFiy
 API_AnalyticalReleaseDescription::stiffnessFiy
Rotation value in Y direction in case of Custom type.
◆ stiffnessFiz
 API_AnalyticalReleaseDescription::stiffnessFiz
Rotation value in Z direction in case of Custom type.
◆ stiffnessX
 API_AnalyticalReleaseDescription::stiffnessX
Translation value in X direction in case of Custom type.
◆ stiffnessY
 API_AnalyticalReleaseDescription::stiffnessY
Translation value in Y direction in case of Custom type.
◆ stiffnessZ
 API_AnalyticalReleaseDescription::stiffnessZ
Translation value in Z direction in case of Custom type.
◆ ux
 API_AnalyticalReleaseDescription::ux
Translation type in X direction.
◆ uy
 API_AnalyticalReleaseDescription::uy
Translation type in Y direction.
◆ uz
 API_AnalyticalReleaseDescription::uz
Translation type in Z direction.